       FD  CLIENTS-FILE.
       01  CLIENT-RECORD.
           05  CLIENT-NAME PIC X(30).
           05  CLIENT-AGE PIC 9(3).
           05  CLIENT-DNI PIC 9(8).
           