       FD  ACCOUNTS-FILE.
       01  ACCOUNT-RECORD.
           05  ACCOUNT-KEY PIC X(5).
           05  ACCOUNT-CLIENT-DNI PIC 9(8).
           05  ACCOUNT-BILL PIC 9(6).
           